app/controllers/orders_controller.rb

INSERT INTO "orders" ("email", "user_id", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", ""], ["user_id", 1], ["start_date", "2017-04-12"], ["created_at", "2017-04-12 02:01:33.271411"], ["updated_at", "2017-04-12 02:01:33.271411"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "days" = ?, "start_date" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["days", 2], ["start_date", "2017-04-15"], ["updated_at", "2017-04-13 00:14:17.814393"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]
---
  def destroy
    @order.destroy

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_order
      @order = Order.find(params[:id])