app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (product_type LIKE '%kid%' OR description LIKE '%kid%')  ORDER BY created_at DESC

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("product_type", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_type", ""], ["description", ""], ["image_url", ""], ["created_at", "2017-04-11 23:27:25.463109"], ["updated_at", "2017-04-11 23:27:25.463109"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "product_type" = ?, "description" = ?, "price_product" = ?, "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_type", "hfj"], ["description", "nfjx"], ["price_product", 0.0], ["image_url", "hfh"], ["updated_at", "2017-04-11 23:27:42.400173"], ["id", 2]]

  def destroy
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]